Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: This chapter presents an overview of the evolution of DITA - an XML-based “end-to-end architecture for creating and delivering modular technical information” (Priestley et al., 2001, p.
zh_cn: 本章概述了 DITA 的发展-——一种基于 XML 的“用于创建和交付模块化技术信息的端到端体系结构”（普里斯特利等人，2001年，第

source: This chapter provides an overview, with examples, of LwDITA maps.
zh_cn: 本章将介绍 LwDITA 地图，并提供示例。

source: This exercise in markup flexibility is a direct application of both the extensible part of XML and the Darwin element in DITA: XML elements can be extended and DITA information types can evolve to accommodate diverse content and processing needs.
zh_cn: 这种关于标记的灵活实践是对 XML 中的可扩展部分和 DITA 中的达尔文元素的直接应用：XML 元素可以扩展，DITA 中的信息类型可以进行调整以适应不同的内容和处理需要。

source: This file, however, is not valid HTML5.
zh_cn: 但是这个文件不是有效的 HTML5 文件，

source: This idea of adding metadata to facilitate modular reuse of text, I first encountered it with a (female) technical communicator at IBM, at the Raleigh lab in the early 90s.
zh_cn: 增加元数据以便利文本的模块化复用，我在首次接触这一理念是20世纪90年代早期，一名在IBM的罗利（Raleigh）实验室工作的技术传播工程师向我阐述了这一理念。

source: This information may be moved to an appendix if it is more than 2—3 pages or is primarily technical in a manual that is intended for people with no programming experience” (1976, p.
zh_cn: 如果内容超过了2-3页或者对于目标人群是无编程经验的用户而言过于技术性，这些信息就会移至附录中。 (1976, p.

source: This information might be entered by an author or maintained by an application.
zh_cn: 这些信息可以由作者输入，也可以由程序维护。

source: This is commonly used to create text alternatives for readers or systems that cannot view the original image.
zh_cn: 通常用于为无法查看原始图像的读者或系统编写替代文本，显示在图像原来的位置上。

source: This is somewhat akin to the ‘hook' at the opening of a novel; if the readers' attention is not captured immediately, he is likely to wander off on any number of tangents and end no better informed than he began.
zh_cn: 这就有点类似于小说开头的“引子”；如果读者注意力没有被立即吸引，他就很可能会转换到其他一系列事务上，并且任何知识都有没学到。

source: This means that if an author decides to include an XML tag that does not belong in the DITA topic DTD, the file will not validate and will report an error when processed.
zh_cn: 这意味着，如果作者在文件中包含不属于DITA主题DTD的XML标记，该文件将无效，并在处理时报错。

source: This mode provides a quick preview of a topic, similar to a WYSIWYG editor.
zh_cn: 在此模式下，可以快速预览话题，就像 WYSIWYG 编辑器一样。

source: This move also planted the seed for disciplinary conventions, as topic-based authoring for online deliverable replaced the long print format of documentation.
zh_cn: 随着基于主题的在线可交付内容创作取代了长期存在的纸质文档，这一步骤也为规范性惯例埋下伏笔。

source: This process of specialization is reflected in the “D” of DITA: topics and their elements can evolve in the Darwinian sense of the word.
zh_cn: 专门化过程反映在DITA的“D”字母上：D代指达尔文进化论，表示主题及其元素能够向前演进。

source: This process of tagging, commenting, and nesting data will look familiar to readers who have used HTML or another markup language.
zh_cn: 对于使用过 HTML 或其他标记语言的读者来说，标记、注释和嵌套数据的过程会非常熟悉。

source: This requires some technical background as well as training and coaching” (2011, p.
zh_cn: 这需要一些技术背景以及培训和指导”（2011，第

source: This restriction of mixed content in block elements has the intention of simplifying LwDITA processing in software tools that will need to combine XML, HTML5, and Markdown topics to produce LwDITA deliverables.
zh_cn: 块元素中混合内容的这种限制旨在简化软件工具中的LwDITA处理，这些软件工具需要结合XML、HTML5和Markdown主题来生成LwDITA交付品。

source: This second line of code enforces the XDITA authoring format.
zh_cn: 第二行代码表示此文件强制使用 XDITA 写作格式，

source: This section will be especially useful to readers who have not ventured into standards and markup languages for intelligent content.
zh_cn: 对于那些没有领略过智能内容标准和标记语言的读者，本节非常有用。

source: This section “introduces new users to the system.
zh_cn: “向新用户介绍系统

source: This separation responds to the expanded audiences of the standard.
zh_cn: 这种划分是为了适应标准受众扩大的现状。

source: This simply creates confusion” (1976, p.
zh_cn: 这只会让用户感到困惑。” (1976, p.

source: This topic does not need a body element.
zh_cn: 该话题不包含主体（body）元素和标题，

source: This topic needs the HTML5 element of <article> to create an environment for content.
zh_cn: 本话题使用HTML5的 <article> 元素创建内容环境，

source: This type of training will primarily enhance an author's understanding of the layers of abstraction and common argumentation moves behind an intelligent content solution.
zh_cn: 这种类型的培训主要会增强作者对抽象层级和智能内容解决方案背后的常见论证的理解。

source: This web version does not include any single sourcing or content reuse features and is only for presentational purposes.
zh_cn: 这个网页版本不包括任何同源开发或内容复用的功能，只是为了展示所用。

source: This sample output includes a link to an external CSS file for formatting.
zh_cn: 该示例输出物包括一个关联到外部 CSS 文件的链接，用于调整版式。

source: This simple output did not require a dedicated stylesheet or choices about pagination and typography.
zh_cn: 该输出物非常简洁，不需要专门的样式表，也不需要标定页码和排版。

source: Those are strong selling points that drive the next chapter.
zh_cn: 这些都是下一章的强大卖点。

source: Those are valid concerns.
zh_cn: 这些都是合理的担忧。

source: Those content units are represented in the document type of topic.
zh_cn: 内容单元用话题文档类型来表示。

source: Those concerns and doubts revolve around a major point of discrepancy in the world of technical communication: in industry, XML and DITA are widely used and some critics even see them as outdated and complex; in academia, “faculty are simply ignoring the subject, even though it has played a central role in the practitioner literature” (Clark, 2016, p.
zh_cn: 这些担忧和怀疑围绕着技术传播领域的一个主要差异点而存在：在工业界，XML 和 DITA 被广泛使用，一些批评者甚至认为它们过于复杂，并且已经过时；而在学术界，“尽管 DITA 在从业者编写的文档中扮演着核心角色，教师们却完全忽视了它”（克拉克，<2016年，第

source: Those conventions, or content commonplaces, specific to the genre of task identified by the DITA architects, created quite the strict template that came with many of the benefits I have mentioned in previous chapters.
zh_cn: 那些作用于DITA架构师定义的任务体裁的惯例或内容常规，创建了相当严格的模板，带来了我在前几章中提到的诸多好处。

source: Those files include topics with instructions for the corporate staff, restaurant operators, franchise owners, recipes for kitchen workers, and even maintenance guidelines for the engineering team.
zh_cn: 这些文件包含各种话题，其中有为公司员工、餐厅经营者、特许经营权所有者编写的说明，为厨房员工编写的菜谱，甚至还有为工程团队编写的维护指南。

source: Those layers of abstraction focus, one by one, on practical and separate concepts related to the characteristics of intelligent content and competencies and skills that, based on industry conversation and formal interviews with practitioners and academics (see Evia et al., 2015 for details on the methodology), are expected of technical communicators working in content management environments.
zh_cn: 这些抽象层级主要关注与智能内容的特性，以及从业者的能力和技能相关的实际和独立概念，而后者提炼自行业对话以及对工业界和学术界的正式访谈（更多方法论细节可参见艾维亚等人2015年所著书籍），也是在内容管理环境中工作的技术传播工程师所需要的掌握的能力和技能。

source: Those moves advanced from the organizational realm (Apple Computer, in his case) and became disciplinary conventions: task and reference (along with concept) are the main content types associated with the DITA standard.
zh_cn: 从组织领域（他举的案例是Apple Computer）脱胎的这些文步成为了规范性惯例：任务和参考（以及概念）是与DITA标准密切相关的内容类型。

source: Those moves included the following:
zh_cn: 文步包含以下内容：

source: Those original layers of abstraction for teaching content development with DITA to students in a department of English are the result of years of collaboration with my former colleagues Matthew Sharp, who is now assistant professor of communication at Embry-Riddle Aeronautical University, and Manuel Perez-Quinones, who is now professor and associate dean of computing and informatics at the University of North Carolina, Charlotte.
zh_cn: 教英语专业学生用 DITA 进行内容开发背后所涉及的抽象层级，是我与前同事马修·夏普、曼努埃尔·佩雷斯-奎诺恩合作多年的成果。马修·夏普现在是安博瑞德航空航天大学传播专业助理教授，曼努埃尔·佩雷斯-奎诺恩现在是北卡罗莱纳大学夏洛特分校计算机和信息学院的教授和副院长。

source: Those pre-established content types are enforced by files that are commonly referred to as DTDs, although DTD is only one of the markup languages used to verify the structure of those files.
zh_cn: 尽管 DTD 只是用于校验这些文件结构的标记语言之一，这些预先建立的内容类型通常由 DTD 文件执行。

source: Those teaching practices prevail despite decades of conversation about the benefits of intelligent content enablers like single-sourcing and reuse and industry best practices.
zh_cn: 尽管智能内容的优势如同源开发、内容复用已经讨论了几十年 ，智能内容也是行业最佳实践，但上文提到的教学实践仍然非常普遍。

source: Those topics can be present in several combinations grouped in maps.
zh_cn: 这些话题可以在地图中分为不同的组合。

source: Those were forces bigger than minimalism.
zh_cn: 这些因素的影响力远超极简主义。

source: Thus, a lone writer developing deliverables for an audience of one or two readers in one type of deliverable, could still find the ideal solution in a word processor.
zh_cn: 因此，如果一位独立作者要为一两位读者编写某种格式的可交付内容，文字处理软件仍然是理想的解决方案。

source: Thus, although LwDITA had the primary objective of reducing the number of content components included in the DITA standard, the subcommittee proposed 9 new components to represent multimedia content to replicate common structures available in HTML5.
zh_cn: 因此，尽管 LwDITA 的主要目标是减少 DITA 标准中包含的内容组件的数量，但小组委员会提出了 9个新组件来表示多媒体内容，复刻了 HTML5 中可用的通用结构。

source: Thus, if authors need a definition list in MDITA, they should express it with a raw HDITA code block.
zh_cn: 因此，如果创作者需要在 MDITA 中使用定义列表，应该使用原始的HDITA代码块编写。

source: Thus, if in DITA 1.3 and HTML5 an author had to decide if their components should include character data, child elements, or a combination of those, in some of the LwDITA authoring formats there is only one valid way t create certain elements.
zh_cn: 因此，如果在DITA 1.3和HTML5中，作者必须决定他们的组件是否应该包括字符数据、子元素或这些元素的组合，那么在一些LwDITA创作格式中，创建元素只有唯一的有效方法。

source: Thus, the recipe collector does not have to invent custom tags.
zh_cn: 因此，菜谱编辑者不必创建自定义标签。

source: Title
zh_cn: 标题组件

source: Title: a label that connotes the purpose of the content associated with it.
zh_cn: 标题（title）：表示内容目的的标签。

source: To a casual observer, the act of writing static content on a word processing application or a presentation-oriented web content management system might look similar to that of creating intelligent content (in both cases a person is typing on a computer), but the “mental” (abstraction) layers behind those processes go beyond the use of “metal” (automation) tools.
zh_cn: 对于一个外行而言，在文字处理软件或面向演示的网页内容管理系统里编写静态内容可能看起来与创建智能内容一样（二者都是由一个人在电脑前打字输入内容），但后者所要求的层级“思考”（抽象）能力远超“物理”（自动化）工具的使用能力。

source: To be honest, error messages from the DITA-OT can be complex and ambiguous.
zh_cn: 坦率地说，DITA-OT 的报错信息可能读起来复杂且难以理解。

source: To create a PDF deliverable from the HDITA map, or if the project had any single-sourcing or content reuse requirements, Chef Pedro and his team would need to process it through a LwDITA-aware tool.
zh_cn: 如果想要利用 HDITA 地图创建 PDF 交付文件，又或者如果项目有任何同源开发或内容复用的需求，厨师佩德罗及其团队需要使用支持 LwDITA 的工具。

source: To create information deliverables ready for human consumption, XML files need to go through a process of publishing that, according to O'Keefe, can involve the following roles, which “in a small group, one person may hold any or all” (2009, p.
zh_cn: 要创建可供人类使用的可交付成果，XML 文件需要经过一个发布流程。根据奥基夫（O'Keefe）的观点，这个发布流程可能涉及以下角色，“而在一个小团队中，一个人可能会承担部分或所有角色”（2009年，第

source: To express ordered and unordered lists in MDITA, you should follow the recommendations from the GFM spec, which specify that “a list is an ordered list if its constituent list items begin with ordered list markers, and a bullet list if its constituent list items begin with bullet list markers” (GitHub Flavored Markdown Spec, 2017).
zh_cn: 在 MDITA 中表示有序列表和无序列表应该遵循 GFM 规范的建议，GFM 规范规定“如果列表组成项以有序列表标记开始，则使用有序列表，如果列表组成项以项目符号列表标记开始，则使用项目符号列表” (GitHub Flavored Markdown Spec, 2017)。

source: To focus on this deliverable while also keeping an eye on future spec development, the subcommittee appointed me as its co-chair and also appointed Keith Schengili-Roberts as secretary.
zh_cn: 为了表示对该文件和未来的标准的重视，小组委员会任命我为联合主席，并任命基思·申吉利–罗伯茨为秘书。

source: To generate an HTML5 version of the marinara recipe critique, you would enter the command (one single line) on a command-line environment inside the directory or folder where you installed the DITA-OT shown in Figure 5.6.
zh_cn: 如果想要生成一个 HTML5 版本的意式番茄罗勒酱菜谱评价，需要在安装了 DITA-OT 的路径或文件夹下，打开命令行环境输入一行命令，如图5.6所示。

source: To illustrate some of those moves, which were present in the early DITA task topic and are still part of the standard, consider the marinara sauce recipe from Chapter 1 (Figure 2.1).
zh_cn: 为了说明一些在早期DITA任务主题中出现且仍然是标准组成部分的文步，请想一想第一章 (图2.1)的意式番茄罗勒酱菜谱。

source: Today, the trend in technical writing is toward providing the user with far less information, an approach called minimalism.
zh_cn: 今天，技术写作的趋势是向用户提供更少的信息，这种方法被称为极简主义。

source: Topic
zh_cn: 话题组件

source: Topic derives from the widely adopted open content standard known as Darwin Information Typing Architecture (DITA), which defines a common structure for content that promotes the consistent creation, sharing, and reuse of content.
zh_cn: “Topic”来源于被广泛采用的开放内容标准达尔文信息类型架构（DITA），该标准定义了内容的一般结构，促进了内容创建、共享和复用的一致性。

source: Topic metadata (<topicmeta>) - defines the metadata that applies to a topic when it appears in a map
zh_cn: 话题元数据(<topicmeta>)可以定义地图中用于描述话题的元数据。

source: Topic metadata: defines the metadata that applies to a topic when it appears in a map.
zh_cn: 话题元数据（topic metadata）：定义地图中用于描述话题的元数据。

source: Topic reference (<topicref>) - identifies and links to a topic or external content source.
zh_cn: 话题引用(<topicref>)用于标识或链接某个话题或外部内容资源。

source: Topic reference: identifies and links to a topic or external content source.
zh_cn: 话题引用（topic reference）：标识或链接到某个话题或外部内容资源。

source: Topic: a coherent unit of content that conveys information.
zh_cn: 主题（topic）：清楚传达信息的内容单元。

source: Topics and maps authored in XDITA are fully compatible with content created according to the DITA 1.3 standard.
zh_cn: 用 XDITA 编写的话题和地图与根据 DITA 标准1.3版本创建的内容完全兼容。

source: Topics can thus be conceived, alternatively, as pigeonholes for locating already existing ideas or as patterns of thought or methods of analysis that can be called on in the construction of arguments.
zh_cn: 因此，主题可以通过构思得来，或是像鸽笼一样用以定位已有的想法，或构建论点时可以被调用的思维模式或分析方法。

source: Track: a link to time-based text data relevant to audio or video content.
zh_cn: 踪迹（track）：与音频或视频内容相关的基于时间的文本数据的链接。

source: Traditionally, and as mentioned in the Adobe video, intelligent content workflows for technical communication rely on structure provided by Extensible Markup Language (XML) and some of its specific grammars like DocBook, S1000D, and DITA (Cowan, 2010; Glushko & McGrath, 2008; Hackos, 2011, among others).
zh_cn: 从传统上来看，也正如在 Adobe 视频中提到的，用于技术传播的智能内容工作流依赖于可扩展标记语言（XML）的结构及其一些特定的语法，如 DocBook、S1000D 和 DITA （考恩，2010年；格鲁什科、麦格拉，2008年；哈克斯， 2011年）。

source: Transforming LwDITA Maps
zh_cn: 转换 LwDITA 地图

source: Translating Technical Facts
zh_cn: 阐述技术事实

source: Trying to define the concept of topic in rhetoric is not that easy.
zh_cn: 试图界定修辞中的主题概念并非易事。

source: Two years after that initial proposal, Priestley started working on the idea of an HTML5-based version of the lightweight framework for representing DITA topics; however, LwDITA does not hide its origins in the XML language.
zh_cn: 在最初提议的两年后，普里斯特利开始着手构思一个基于HTML5的轻量级框架版本，用于表示DITA主题；但是，LwDITA仍有XML语言的明显印记。

source: Undeniably, DITA XML has an audience that has made the standard a very popular approach for structuring information.
zh_cn: 不可否认的是，DITA XML的受众使该标准成为结构化信息的一种广泛流行的方法。

source: Underline.
zh_cn: 下划线

source: Underline, also called an underscore, which is a more or less horizontal line immediately below a portion of writing.
zh_cn: 下划线（underline）是仅靠文字底部的水平线。

source: Unlike its counterpart in XDITA, this definition list does not need the holding definition entry environment to contain pairs of definition term and definition description.
zh_cn: 与 XDITA 中的定义列表组件不同的是，本例中定义列表不需要定义条目来包裹成对的定义术语和定义描述。

source: Unordered list: a series of items in which the order is not significant.
zh_cn: 无序列表（unordered list）：无序的一系列项目。

source: Unordered lists.
zh_cn: 无序列表

source: Use them” (1976, p.
zh_cn: 一定要善用它” (1976, p.

source: Using Darwinian terminology that resonates with design principles of the DITA and LwDITA standards, Miller noted that “in trying to understand the process of genre change and the emergence of what seem to be 'new genres' in both new and old media, we have come to rely heavily on the concept of ‘evolution'” (2015, p.
zh_cn: 达尔文式这一术语同DITA和轻量级DITA的设计原则不谋而合，米勒用这一术语指出“在试图理解体裁演变历程即新旧媒体中‘新体裁’的涌现时，我们严重依赖‘演进’这一概念。”(2015, p.

source: Using the DITA-OT, which I will cover in more detail in Chapters 5 and 6, I transformed
zh_cn: 使用 DITA-OT（将在第5 章和第6章详细介绍），我将地图转换成了

source: Video: a link to an audiovisual product to be included in the content.
zh_cn: 视频（video）：内容中视听产品的链接。

source: Visual communication
zh_cn: 视觉传达

source: Visual effectiveness (Carey et al., 2014, p.
zh_cn: 视觉效率 (Carey et al., 2014, p.

source: WITH LIGHTWEIGHT DITA
zh_cn: 使用轻量 DITA

source: We cannot afford the manual.
zh_cn: 手册已经不合算了。

source: We decided to move the conversations about the Markdown-based
zh_cn: 我们决定将关于基于 Markdown 的 LwDITA 版本（现在更名为 MDITA）的讨论

source: We developed those layers following the approach for teaching professional writing recommended by Linda Flower, which “acknowledges the importance of discourse conventions but concentrates on broader rhetorical strategies for analyzing the audience, planning, revising, and managing one's time and writing process” (1989, p.5).
zh_cn: 我们按照琳达•弗劳尔推荐的专业写作教学方法制定了这些层级，琳达•弗劳尔的方法“承认话语风格的重要性，但专注于更广泛的修辞策略，以分析读者，规划、修订和管理个人时间和写作过程” (1989, p.5)。

source: We live in a much better world.” Carroll pointed out that those early days of computing were dominated by data-processing professionals in a highly selective environment: “They were mostly white men, and now computers are used by everybody in the world” (J.
zh_cn: 我们生活的世界变好了。”卡罗尔指出计算机发展早期，数据处理的专业人员占据了主导地位，并且当时的从业环境非常苛刻：“大部分人员都是白人男性，而现在全球范围内人人都用上了电脑。”(J.

source: We made a plan for a research study and then the conversation moved to the possibility of using Markdown as an authoring language in LwDITA topics.
zh_cn: 我们制定了研究计划，然后又讨论了在 LwDITA 话题中使用 Markdown 作为写作语言的可能性。

source: We reminisced about the Virginia Tech Center for Human-Computer Interaction (CHCI), which Carroll founded in 1995.
zh_cn: 我们想起了卡罗尔在1995年创立的弗吉尼亚理工大学人机交互中心(CHCI)。

source: We scheduled a phone call on April 30, 2014 that started our ongoing collaboration, but that also introduced a third authoring format for the proposed LwDITA standard.
zh_cn: 我们计划在2014年4月30日进行一次电话会议，以启动接下来的合作，这次通话这也为提议的 LwDITA 标准引入了第三种创作格式。

source: We stripped a lot of bloated material out of inventory as part of our conversion to DITA.
zh_cn: 在向DITA转变的过程中我们从库存中抛弃了大量冗余的材料

source: We then moved on to the technical communication-related accusations that hang over John Carroll's head.
zh_cn: 我们再次聚焦针对约翰·卡罗尔有关技术传播的指控

source: We want to make both editing and specialization easier for vendors to support by limiting options and choice points.
zh_cn: 我们希望通过限制选项和选择点，使供应商更容易支持内容编写和话题专门化。

source: Weak Verbs
zh_cn: 弱动词

source: What are we seeing?
zh_cn: 我们期待什么？

source: What could happen if we introduced my students to a DITA-like environment without starting with XML?
zh_cn: 如果不从 XML 开始教，而是直接向我的学生介绍一个类 DITA 的环境，会发生什么呢？

source: What that means to information developers is that you can author a DocBook or DITA topic in one tool and open the topic in another tool without the loss of information or invalid markup.
zh_cn: 对于信息开发者来说，这意味着你可以在一个工具中编写 DocBook 或 DITA 话题，然后在另一个工具中打开该话题，而不会丢失任何信息或产生无效标记。

source: When I introduce LwDITA in university courses and industry workshops, many authors who have previous experience with DITA XML, and even some who are not familiar with DITA but have worked with HTML, are initially confused by the “minimize mixed content” rule that defines some components in this proposed standard.
zh_cn: 当我在大学课程和行业研讨会中介绍LwDITA时，许多曾经使用过DITA XML的作者，甚至一些不熟悉DITA但使用过HTML的作者，一开始都对“最小化混合内容”规则所迷惑，这一规则定义了这一提议规则的一些组件。

source: When I tried to measure the impact of John Carroll's theory of minimalism on content development, I remembered that Michael Priestley has acknowledged in several occasions that minimalism, via the IBM publication Developing Quality Technical Information (DQTI), was one of the big influences on DITA.
zh_cn: 当我试图衡量约翰·卡罗尔极简主义理论对内容发展的影响时，我想起迈克尔·普里斯特利在多个场合承认，经由IBM出版的《开发高质量技术信息》，极简主义对DITA造成的影响名列前茅。

source: When a change needs to be reflected in those information products (e.g., the kitchen introduces a new special or the office's telephone number should be updated), Chef Pedro makes the changes in his original Word files, and then the publications team has to manually update the menus, flyers, and website that borrow content from the Word master source.
zh_cn: 当需要改动这些信息产品（例如,厨房里引入了一个新的特色菜或需要更新办公室电话号码），佩德罗会先改动最初的 Word 文档，然后出版团队不得不根据Word文档这一主要内容来源手动更新菜单、传单和网站。

source: When he talks about “reusable content,” Mathewson is referring to the “practice of using content components in multiple information products” (Eberlein, 2016 p.
zh_cn: 马修森所说的“可重用内容”是指“在多个信息产品中使用内容组件的实践”（埃伯莱因，2016年，第

source: When it came to content, he recommended to “(s)uit the complexity of the manual to the complexity of the subject, and don't belabor the obvious.” He defined intent as the goal to cover the users' needs: “The documentation should be clearly aimed at the prospective user of the system.
zh_cn: 当谈到内容时，他建议“手册的复杂程度要适应主题的复杂程度，显而易见的内容就不要冗余的阐述。”他将意图定义为满足用户需求：“文档应明确针对系统的预期用户。”

source: When opened on a browser, the map creates a navigation menu for the topic collection.
zh_cn: 在浏览器上打开该交付物，地图将为话题集合创建一个导航菜单。

source: When other companies heard about DITA and tried to create their own architectures for authoring and publishing, the topical conventions moved to the disciplinary category, which started when IBM announced, on March 15, 2001 that they “were going public with an architecture for technical documentation using XML” (Priestley, 2001a), and then culminated with the release of DITA 1.0 as an open standard in 2005.
zh_cn: 当其他公司听说DITA，并试图拆功能键自己的创作和出版架构时，主题惯例转向了规范性惯例。起点是IBM在2001年 3月 15日 宣布他们“要公开一个使用XML的技术文档架构”(Priestley, 2001a)，最后，在2005年，DITA 1.0 作为开放标准发布。

source: When placed with other topics in a collection and processed by a DITA-aware software tool (I will talk more about tools in Chapter 5), this biographic introduction can inherit any formatting rules and become a page or section in a print magazine or book, a page or blurb on a website, and many other end-user deliverables depending on the author's publishing goals.
zh_cn: 当这一传记介绍同其他主题被放在一个集合中，并由支持DITA软件工具（ 第五章我会详细阐述）进行处理时，这一介绍信息能继承任意格式规则，可以成为纸质杂志或书籍的一页或一章、网站上的网页或宣传信息以及其他多种终端用户的交付物，呈现形式取决于作者的出版目标。

source: When talking about covering concepts of computing outside of computer science courses, Perkovic et al.
zh_cn: 在谈及计算机科学课程之外的计算机概念时，佩尔科维奇等人

source: When the developer stopped updating the application and it became obsolete, Pedro's content was locked and required an expensive and time-consuming process of conversion to be rescued in another program.
zh_cn: 当开发人员停止更新软件时，这个软件就废弃了，而佩德罗制作的内容也被锁定在软件当中，需要花费巨额才能将内容转换到另一个软件中，并且耗时漫长。

source: When we were designing the XDITA content and collection components, the Lightweight DITA subcommittee at OASIS developed user personas and scenarios based on the following intended audiences:
zh_cn: 当我们设计XDITA内容和组件集时，OASIS的轻量级DITA小组委员会基于以下目标受众开发了用户角色和场景:

source: When writing software manuals, technical writers have historically distinguished task-based instructions (guidance information) from reference information.
zh_cn: 在编写软件手册时，技术作者历来将基于任务的指令(指导信息)与参考信息区分开来。

source: Whereas XDITA and MDITA were designed to be functionally equivalent to each other, MDITA was created as a compatible subset that allows authors to represent basic DITA-like components in Markdown syntax.
zh_cn: 虽然XDITA和MDITA被设计为功能上等价的，但MDITA是作为一个兼容子集创建的，它允许作者用Markdown语法表示类似于DITA的基础组件。

source: Whereas in DITA 1.3 a definition description can contain character data or additional XML elements, in XDITA it must include a paragraph (<p>) housing any text.
zh_cn: 在 DITA 标准1.3版本中，定义描述可以包含字符数据或其他 XML 元素，而在 XDITA 中，必须用段落标签 (<p>) 来包裹文本内容。
